# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Wed May 14 04:35:59 EDT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design mcs4

create_clock -name "250kHz_CLK" -period 4000.0 -waveform {0.0 2000.0} [get_ports sysclk]
set_clock_transition -min 20.0 [get_clocks 250kHz_CLK]
set_clock_transition -max 100.0 [get_clocks 250kHz_CLK]
set_load -pin_load 0.005 [get_ports {p_out[9]}]
set_load -pin_load 0.005 [get_ports {p_out[8]}]
set_load -pin_load 0.005 [get_ports {p_out[7]}]
set_load -pin_load 0.005 [get_ports {p_out[6]}]
set_load -pin_load 0.005 [get_ports {p_out[5]}]
set_load -pin_load 0.005 [get_ports {p_out[4]}]
set_load -pin_load 0.005 [get_ports {p_out[3]}]
set_load -pin_load 0.005 [get_ports {p_out[2]}]
set_load -pin_load 0.005 [get_ports {p_out[1]}]
set_load -pin_load 0.005 [get_ports {p_out[0]}]
set_load -pin_load 0.005 [get_ports {io_pad[7]}]
set_load -pin_load 0.005 [get_ports {io_pad[6]}]
set_load -pin_load 0.005 [get_ports {io_pad[5]}]
set_load -pin_load 0.005 [get_ports {io_pad[4]}]
set_load -pin_load 0.005 [get_ports {io_pad[3]}]
set_load -pin_load 0.005 [get_ports {io_pad[2]}]
set_load -pin_load 0.005 [get_ports {io_pad[1]}]
set_load -pin_load 0.005 [get_ports {io_pad[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports poc_pad]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports clear_pad]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[7]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[7]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[6]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[6]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[5]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[5]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[4]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[4]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[3]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[3]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[2]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[2]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[1]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[1]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[0]}]
set_input_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[0]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[7]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[7]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[6]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[6]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[5]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[5]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[4]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[4]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[3]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[3]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[2]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[2]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[1]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[1]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[0]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {io_pad[0]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[9]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[8]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[7]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[6]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[5]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[4]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[3]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[2]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[1]}]
set_output_delay -clock [get_clocks 250kHz_CLK] -add_delay 200.0 [get_ports {p_out[0]}]
set_max_fanout 15.000 [current_design]
set_max_transition 10.0 [current_design]
set_max_capacitance 0.005 [get_ports {p_out[9]}]
set_max_capacitance 0.005 [get_ports {p_out[8]}]
set_max_capacitance 0.005 [get_ports {p_out[7]}]
set_max_capacitance 0.005 [get_ports {p_out[6]}]
set_max_capacitance 0.005 [get_ports {p_out[5]}]
set_max_capacitance 0.005 [get_ports {p_out[4]}]
set_max_capacitance 0.005 [get_ports {p_out[3]}]
set_max_capacitance 0.005 [get_ports {p_out[2]}]
set_max_capacitance 0.005 [get_ports {p_out[1]}]
set_max_capacitance 0.005 [get_ports {p_out[0]}]
set_max_capacitance 0.005 [get_ports {io_pad[7]}]
set_max_capacitance 0.005 [get_ports {io_pad[6]}]
set_max_capacitance 0.005 [get_ports {io_pad[5]}]
set_max_capacitance 0.005 [get_ports {io_pad[4]}]
set_max_capacitance 0.005 [get_ports {io_pad[3]}]
set_max_capacitance 0.005 [get_ports {io_pad[2]}]
set_max_capacitance 0.005 [get_ports {io_pad[1]}]
set_max_capacitance 0.005 [get_ports {io_pad[0]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports poc_pad]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports clear_pad]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[7]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[6]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[5]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[4]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[3]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[2]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[1]}]
set_driving_cell -lib_cell BUFX2 -pin "Y" [get_ports {io_pad[0]}]
set_clock_latency  100.0 [get_clocks 250kHz_CLK]
set_clock_latency -source 100.0 [get_clocks 250kHz_CLK]
set_clock_uncertainty -setup 100.0 [get_clocks 250kHz_CLK]
set_clock_uncertainty -hold 20.0 [get_clocks 250kHz_CLK]
