# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Thu May 15 20:25:06 EDT 2025

# ####################################################################

set sdc_version 1.1


# Set the current design
current_design mcs4_pad_frame

create_clock -name "My_CLK" -period 50.0 -waveform {0.0 25.0} [get_ports sysclk]
set_clock_transition -rise -min 2.0 [get_clocks My_CLK]
set_clock_transition -rise -max 2.75 [get_clocks My_CLK]
set_clock_transition -fall -min 1.5 [get_clocks My_CLK]
set_clock_transition -fall -max 2.5 [get_clocks My_CLK]
set_load -pin_load 0.005 [get_ports {p_out[9]}]
set_load -pin_load 0.005 [get_ports {p_out[8]}]
set_load -pin_load 0.005 [get_ports {p_out[7]}]
set_load -pin_load 0.005 [get_ports {p_out[6]}]
set_load -pin_load 0.005 [get_ports {p_out[5]}]
set_load -pin_load 0.005 [get_ports {p_out[4]}]
set_load -pin_load 0.005 [get_ports {p_out[3]}]
set_load -pin_load 0.005 [get_ports {p_out[2]}]
set_load -pin_load 0.005 [get_ports {p_out[1]}]
set_load -pin_load 0.005 [get_ports {p_out[0]}]
set_load -pin_load 0.005 [get_ports {io_pad[7]}]
set_load -pin_load 0.005 [get_ports {io_pad[6]}]
set_load -pin_load 0.005 [get_ports {io_pad[5]}]
set_load -pin_load 0.005 [get_ports {io_pad[4]}]
set_load -pin_load 0.005 [get_ports {io_pad[3]}]
set_load -pin_load 0.005 [get_ports {io_pad[2]}]
set_load -pin_load 0.005 [get_ports {io_pad[1]}]
set_load -pin_load 0.005 [get_ports {io_pad[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports poc_pad]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports clear_pad]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD_IOR]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD_IOR]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS_IOR]
set_input_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS_IOR]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD_IOR]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VDD_IOR]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS_IOR]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports VSS_IOR]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[9]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[8]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[7]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[6]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[5]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[4]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[3]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[2]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[1]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {p_out[0]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[7]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[6]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[5]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[4]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[3]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[2]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[1]}]
set_output_delay -clock [get_clocks My_CLK] -add_delay 0.5 [get_ports {io_pad[0]}]
set_max_fanout 15.000 [current_design]
set_max_capacitance 0.005 [get_ports {p_out[9]}]
set_max_capacitance 0.005 [get_ports {p_out[8]}]
set_max_capacitance 0.005 [get_ports {p_out[7]}]
set_max_capacitance 0.005 [get_ports {p_out[6]}]
set_max_capacitance 0.005 [get_ports {p_out[5]}]
set_max_capacitance 0.005 [get_ports {p_out[4]}]
set_max_capacitance 0.005 [get_ports {p_out[3]}]
set_max_capacitance 0.005 [get_ports {p_out[2]}]
set_max_capacitance 0.005 [get_ports {p_out[1]}]
set_max_capacitance 0.005 [get_ports {p_out[0]}]
set_max_capacitance 0.005 [get_ports {io_pad[7]}]
set_max_capacitance 0.005 [get_ports {io_pad[6]}]
set_max_capacitance 0.005 [get_ports {io_pad[5]}]
set_max_capacitance 0.005 [get_ports {io_pad[4]}]
set_max_capacitance 0.005 [get_ports {io_pad[3]}]
set_max_capacitance 0.005 [get_ports {io_pad[2]}]
set_max_capacitance 0.005 [get_ports {io_pad[1]}]
set_max_capacitance 0.005 [get_ports {io_pad[0]}]
set_max_capacitance 0.005 [get_ports VDD]
set_max_capacitance 0.005 [get_ports VSS]
set_max_capacitance 0.005 [get_ports VDD_IOR]
set_max_capacitance 0.005 [get_ports VSS_IOR]
set_driving_cell -lib_cell BUFX12 -pin "Y" [get_ports poc_pad]
set_driving_cell -lib_cell BUFX12 -pin "Y" [get_ports clear_pad]
set_clock_latency  -rise 2.0 [get_clocks My_CLK]
set_clock_latency  -fall 1.5 [get_clocks My_CLK]
set_clock_latency -source -rise 1.0 [get_clocks My_CLK]
set_clock_latency -source -fall 0.75 [get_clocks My_CLK]
set_clock_uncertainty -setup 0.5 [get_clocks My_CLK]
set_clock_uncertainty -hold 0.25 [get_clocks My_CLK]
