###############################################################
#  Generated by:      Cadence Innovus 21.12-s106_1
#  OS:                Linux x86_64(Host ID ip-10-16-10-154.rdius.us)
#  Generated on:      Sat May 17 17:33:34 2025
#  Design:            mcs4_pad_frame
#  Command:           routeDesign -globalDetail
###############################################################
current_design mcs4_pad_frame
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {sysclk}]  -name My_CLK -period 50.000000 -waveform {0.000000 25.000000}
set_clock_transition  -rise -min 2 [get_clocks {My_CLK}]
set_clock_transition  -rise -max 2.75 [get_clocks {My_CLK}]
set_clock_transition  -fall -min 1.5 [get_clocks {My_CLK}]
set_clock_transition  -fall -max 2.5 [get_clocks {My_CLK}]
set_propagated_clock  [get_ports {sysclk}]
set_driving_cell -lib_cell BUFX12 -rise -min -pin Y [get_ports {poc_pad}]
set_driving_cell -lib_cell BUFX12 -fall -min -pin Y [get_ports {poc_pad}]
set_driving_cell -lib_cell BUFX12 -rise -max -pin Y [get_ports {poc_pad}]
set_driving_cell -lib_cell BUFX12 -fall -max -pin Y [get_ports {poc_pad}]
set_driving_cell -lib_cell BUFX12 -rise -min -pin Y [get_ports {clear_pad}]
set_driving_cell -lib_cell BUFX12 -fall -min -pin Y [get_ports {clear_pad}]
set_driving_cell -lib_cell BUFX12 -rise -max -pin Y [get_ports {clear_pad}]
set_driving_cell -lib_cell BUFX12 -fall -max -pin Y [get_ports {clear_pad}]
set_load -pin_load -max  0.005  [get_ports {p_out[9]}]
set_load -pin_load -min  0.005  [get_ports {p_out[9]}]
set_max_capacitance 0.005  [get_ports {p_out[9]}]
set_load -pin_load -max  0.005  [get_ports {p_out[8]}]
set_load -pin_load -min  0.005  [get_ports {p_out[8]}]
set_max_capacitance 0.005  [get_ports {p_out[8]}]
set_load -pin_load -max  0.005  [get_ports {p_out[7]}]
set_load -pin_load -min  0.005  [get_ports {p_out[7]}]
set_max_capacitance 0.005  [get_ports {p_out[7]}]
set_load -pin_load -max  0.005  [get_ports {p_out[6]}]
set_load -pin_load -min  0.005  [get_ports {p_out[6]}]
set_max_capacitance 0.005  [get_ports {p_out[6]}]
set_load -pin_load -max  0.005  [get_ports {p_out[5]}]
set_load -pin_load -min  0.005  [get_ports {p_out[5]}]
set_max_capacitance 0.005  [get_ports {p_out[5]}]
set_load -pin_load -max  0.005  [get_ports {p_out[4]}]
set_load -pin_load -min  0.005  [get_ports {p_out[4]}]
set_max_capacitance 0.005  [get_ports {p_out[4]}]
set_load -pin_load -max  0.005  [get_ports {p_out[3]}]
set_load -pin_load -min  0.005  [get_ports {p_out[3]}]
set_max_capacitance 0.005  [get_ports {p_out[3]}]
set_load -pin_load -max  0.005  [get_ports {p_out[2]}]
set_load -pin_load -min  0.005  [get_ports {p_out[2]}]
set_max_capacitance 0.005  [get_ports {p_out[2]}]
set_load -pin_load -max  0.005  [get_ports {p_out[1]}]
set_load -pin_load -min  0.005  [get_ports {p_out[1]}]
set_max_capacitance 0.005  [get_ports {p_out[1]}]
set_load -pin_load -max  0.005  [get_ports {p_out[0]}]
set_load -pin_load -min  0.005  [get_ports {p_out[0]}]
set_max_capacitance 0.005  [get_ports {p_out[0]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[7]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[7]}]
set_max_capacitance 0.005  [get_ports {io_pad[7]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[6]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[6]}]
set_max_capacitance 0.005  [get_ports {io_pad[6]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[5]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[5]}]
set_max_capacitance 0.005  [get_ports {io_pad[5]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[4]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[4]}]
set_max_capacitance 0.005  [get_ports {io_pad[4]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[3]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[3]}]
set_max_capacitance 0.005  [get_ports {io_pad[3]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[2]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[2]}]
set_max_capacitance 0.005  [get_ports {io_pad[2]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[1]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[1]}]
set_max_capacitance 0.005  [get_ports {io_pad[1]}]
set_load -pin_load -max  0.005  [get_ports {io_pad[0]}]
set_load -pin_load -min  0.005  [get_ports {io_pad[0]}]
set_max_capacitance 0.005  [get_ports {io_pad[0]}]
set_max_fanout 15  [get_designs {mcs4_pad_frame}]
set_input_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {poc_pad}]
set_input_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VDD_IOR}]
set_input_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {clear_pad}]
set_input_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VDD}]
set_input_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VSS_IOR}]
set_input_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VSS}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[8]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[6]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[7]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[4]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[5]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VDD_IOR}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VDD}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[9]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[7]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VSS_IOR}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[5]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[6]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[4]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {p_out[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {io_pad[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {My_CLK}] [get_ports {VSS}]
set_clock_uncertainty 0.25 -hold [get_clocks {My_CLK}]
set_clock_uncertainty 0.5 -setup [get_clocks {My_CLK}]
